app/controllers/examples_controller.rb

  def create
    @user = current_user
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "username" = 'sandhya', "updated_at" = '2012-11-29 07:14:44.506796' WHERE "users"."id" = 12